app/controllers/students_controller.rb

  def set_student
    @student = Student.find(parmas[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]